export default {
    xiaochou: {
        delay: 300,
        area: ['=', '+', '-'], // null 表示全部
        key: [
            '1+ 3 3 1+ 3 4h 4&3 2', '3 6- 7- 1 2 3 2 3', '3 4 3 4 6 3&4 3 1 3', '3 4 3 6- 7- 1 4 3',
            '1+ 6 6 1+ 6 1+ 3 7', '7 7 6 7&1+ 7&6 5 5 2 3', '2 4 2 3 4 3 3 1+ 6&6', '6 2+ 7 1+ 2+ 1+ 2+ 7 2+&2+',
            '1+ 1+ 1+ 7 1+', '7&7 3+ 3+ 2+ 3+', '6 5h 6 7 1+&6 6', '5h 6 7 5 3',
            '2 3 4 3 2 3 4 3+ 2+&2+ 3+ 7 1+&1+', '2+ 2+ 2+ 2+ 2+ 6', '2+&3+ 7 7 3+&3+',
            '1+ 1+ 1+ 7 1+', '7&7 3+ 3+ 2+ 3+', '6 5h 6 7 1+&6 6', '5h 6 7 5 3',
            '2 3 4 3 2 3 4 3+ 2+&2+ 3+ 7 1+&1+', '6 1+ 2+ 3+ 7 2+ 1+&1+ 6'
        ],
        word: [
            '当你走进这欢乐场', '背上所有的梦与想', '各色的脸上各色的妆', '没人记得你的模样',
            '三巡酒过你在角落', '固执的唱着苦涩的歌', '听它在喧嚣里被淹没', '你拿起酒杯对自己说',
            '一杯敬朝阳', '一杯敬月光', '唤醒我的向往', '温柔了寒窗',
            '于是可以不回头地逆风飞翔', '不怕心头有雨', '眼底有霜',
            '一杯敬故乡', '一杯敬远方', '守着我的善良', '催着我成长',
            '所以南北的路从此不再漫长', '灵魂不再无处安放'
        ],
        letter: null // null 会用cnchar自动生成首字母
    },
    maque: {
        delay: 300,
        area: ['=', '+', '-'], // null 表示全部
        key: [
            '1+&7 6 6 5 6 5 3 3',
            '1 2 2 1 2 1 6- 6-',
            '1 2 2 1 2 3 5 2 2 3&3 5 3',
            '1+&7 6 6 5 6 5 3 3',
            '1 2 2 1 2 1 6- 6-',
            '1 2 2 1 2 5&5 1&6- 6- 5- 6-&6-',
            '3 1+ 3 7 2& 6-&6-'
        ],
        word: [
            '我飞翔在乌云之中',
            '你看着我无动于衷',
            '有多少次波涛汹涌在我心中',
            '你飞向了雪山之巅',
            '我留在你回忆里面',
            '你成仙我替你留守人间',
            '麻雀也有明天'
        ],
        letter: null // null 会用cnchar自动生成首字母
    },
    mojito: {
        delay: 300,
        area: ['=', '+', '-'], // null 表示全部
        key: [
            '3 6 1+ 3+ 2+ 1+ 2+ 1+ 7 6 7 1+ 6',
            '3 6 1+ 3+ 2+ 1+ 2+ 1+ 7 6 7 1+',
            '6 1h+ 3+ 5+ 4+&4+ 5 7 2+ 4+ 3+&3+',
            '3 6 1+ 3+ 2+ 2+ 3+ 2+ 1+ 7 6 7',
            '3 6 1+ 3+ 2+ 1+ 2+ 1+ 7 6 7 1+ 6',
            '3 6 1+ 3+ 2+ 1+ 2+ 1+ 7 6 7 1+',
            '6 1h+ 3+ 5+ 4+&4+ 5 7 2+ 4+ 3+&3+',
            '4 6 1+ 3+ 2+ 2+ 3+ 2+ 1+ 7 1+ 6'
        ],
        word: [
            '麻烦给我的爱人来一杯莫吉托',
            '我喜欢阅读她微醺时的眼眸',
            '而我的咖啡糖不用太多',
            '这世界已经因为她甜得过头',
            '没有跟她笑容一样浓郁的雪茄',
            '就别浪费时间介绍收起来吧',
            '拱廊的壁画旧城的涂鸦',
            '所有色彩都因为她说不出话'
        ],
        letter: null // null 会用cnchar自动生成首字母
    }
};