export default [
    {
        name: '消愁-毛不易',
        choosed: false,
        data: {
            delay: 300,
            area: ['=', '+', '-'], // null 表示全部
            key: [
                '1+ 3 3 1+ 3 4h 4&3 2', '3 6- 7- 1 2 3 2 3', '3 4 3 4 6 3&4 3 1 3', '3 4 3 6- 7- 1 4 3',
                '1+ 6 6 1+ 6 1+ 3 7', '7 7 6 7&1+ 7&6 5 5 2 3', '2 4 2 3 4 3 3 1+ 6&6', '6 2+ 7 1+ 2+ 1+ 2+ 7 2+&2+',
                '1+ 1+ 1+ 7 1+', '7&7 3+ 3+ 2+ 3+', '6 5h 6 7 1+&6 6', '5h 6 7 5 3',
                '2 3 4 3 2 3 4 3+ 2+&2+ 3+ 7 1+&1+', '2+ 2+ 2+ 2+ 2+ 6', '2+&3+ 7 7 3+&3+',
                '1+ 1+ 1+ 7 1+', '7&7 3+ 3+ 2+ 3+', '6 5h 6 7 1+&6 6', '5h 6 7 5 3',
                '2 3 4 3 2 3 4 3+ 2+&2+ 3+ 7 1+&1+', '6 1+ 2+ 3+ 7 2+ 1+&1+ 6'
            ],
            word: [
                '当你走进这欢乐场', '背上所有的梦与想', '各色的脸上各色的妆', '没人记得你的模样',
                '三巡酒过你在角落', '固执的唱着苦涩的歌', '听它在喧嚣里被淹没', '你拿起酒杯对自己说',
                '一杯敬朝阳', '一杯敬月光', '唤醒我的向往', '温柔了寒窗',
                '于是可以不回头地逆风飞翔', '不怕心头有雨', '眼底有霜',
                '一杯敬故乡', '一杯敬远方', '守着我的善良', '催着我成长',
                '所以南北的路从此不再漫长', '灵魂不再无处安放'
            ],
            letter: null // null 会用cnchar自动生成首字母
        }
    },
    {
        name: '麻雀-李荣浩',
        choosed: false,
        data: {
            delay: 300,
            area: ['=', '+', '-'], // null 表示全部
            key: [
                '1+&7 6 6 5 6 5 3 3',
                '1 2 2 1 2 1 6- 6-',
                '1 2 2 1 2 3 5 2 2 3&3 5 3',
                '1+&7 6 6 5 6 5 3 3',
                '1 2 2 1 2 1 6- 6-',
                '1 2 2 1 2 5&5 1&6- 6- 5- 6-&6-',
                '3 1+ 3 7 2& 6-&6-'
            ],
            word: [
                '我飞翔在乌云之中',
                '你看着我无动于衷',
                '有多少次波涛汹涌在我心中',
                '你飞向了雪山之巅',
                '我留在你回忆里面',
                '你成仙我替你留守人间',
                '麻雀也有明天'
            ],
            letter: null // null 会用cnchar自动生成首字母
        },
    },
    {
        name: 'Mojito-周杰伦',
        choosed: false,
        data: {
            delay: 300,
            area: ['=', '+', '-'], // null 表示全部
            key: [
                '3 6 1+ 3+ 2+ 1+ 2+ 1+ 7 6 7 1+ 6',
                '3 6 1+ 3+ 2+ 1+ 2+ 1+ 7 6 7 1+',
                '6 1h+ 3+ 5+ 4+&4+ 5 7 2+ 4+ 3+&3+',
                '3 6 1+ 3+ 2+ 2+ 3+ 2+ 1+ 7 6 7',
                '3 6 1+ 3+ 2+ 1+ 2+ 1+ 7 6 7 1+ 6',
                '3 6 1+ 3+ 2+ 1+ 2+ 1+ 7 6 7 1+',
                '6 1h+ 3+ 5+ 4+&4+ 5 7 2+ 4+ 3+&3+',
                '4 6 1+ 3+ 2+ 2+ 3+ 2+ 1+ 7 1+ 6'
            ],
            word: [
                '麻烦给我的爱人来一杯莫吉托',
                '我喜欢阅读她微醺时的眼眸',
                '而我的咖啡糖不用太多',
                '这世界已经因为她甜得过头',
                '没有跟她笑容一样浓郁的雪茄',
                '就别浪费时间介绍收起来吧',
                '拱廊的壁画旧城的涂鸦',
                '所有色彩都因为她说不出话'
            ],
            letter: null // null 会用cnchar自动生成首字母
        }
    },
    {
        name: '十年-陈奕迅',
        choosed: false,
        data: {
            delay: 300,
            area: ['=', '+', '-'], // null 表示全部
            key: [
                '5- 3 2 1 2 3 2&2 5-',
                '1 6- 7- 1 6 5 1 3',
                '3 2 3 4 2 3&3 4 3',
                '1 2 5&3 3',
                '3&3 4 5 6 2 2&2 4 3 2 1',
                '3-&3- 2 1 7- 1&6- 6-',
                '1 7- 6- 7- 4 3 2 7- 1&1',
                '1 2 3 6 3 4 5 3&3 2',
                '1 2 5&3 3',
                '3&3 4 5 6 2 2&2 4 3 2 1',
                '3-&3- 2 1 7- 1&6- 6-',
                '1 7- 6- 7- 4 3 2 3 2&2 1',
                '1 2 3 6 6 3 1 2&2 1&7- 1'
            ],
            word: [
                '怀抱既然不能逗留',
                '何不在离开的时候',
                '一边享受一边泪流',
                '十年之前',
                '我不认识你你不属于我',
                '我们还是一样',
                '陪在一个陌生人左右',
                '走过渐渐熟悉的街头',
                '十年之后',
                '我们是朋友还可以问候',
                '只是那种温柔',
                '再也找不到拥抱的理由',
                '情人最后难免沦为朋友'
            ],
            letter: null // null 会用cnchar自动生成首字母
        }
    },
    {
        name: '后来-刘若英',
        choosed: false,
        data: {
            delay: 250,
            area: ['=', '+', '-'], // null 表示全部
            key: [
                '6- 6- 4 3 4 1 7-&7-',
                '7- 7- 7- 5 4 5 4 3&3',
                '3 3 2 1&1',
                '6- 6- 7- 1 6- 1 3 3 2 2&2',
                '3&2&1 1',
                '1 1 2 3 4 3 3&4 2 1 2&2',
                '7- 7- 1&1 6- 6- 7- 1',
                '1 2 3 7- 7-&7-',
                '1&7-&6- 6-',
                '6 5 4 3 4 5 7- 1',
                '4 3 4 4 4 3 2 1 7- 2&1'
            ],
            word: [
                '你都如何回忆我',
                '带著笑或是很沉默',
                '这些年来',
                '有没有人能让你不寂寞',
                '后来',
                '我总算学会了如何去爱',
                '可惜你早已远去',
                '消失在人海',
                '后来',
                '终于在眼泪中明白',
                '有些人一旦错过就不再'
            ],
            letter: null // null 会用cnchar自动生成首字母
        }
    },
    {
        name: '平凡之路-朴树',
        choosed: false,
        data: {
            delay: 250,
            area: ['=', '+', '-'], // null 表示全部
            key: [
                '5 6 7 1+ 7 1+ 5 6 6',
                '4 3 3 3 4 3 2',
                '5 6 7 1+ 7 1+ 5 6 6',
                '6 1+ 1+ 1+ 1+ 1+ 2+',
                '5 6 7 1+ 7 1+ 3+',
                '6+ 5+ 4+ 3+ 3+ 2+',
                '6 7 1+ 1+ 7 1+',
                '1+ 1+ 1+ 2+ 1+ 7 1+'
            ],
            word: [
                '我曾经跨过山和大海',
                '也穿过人山人海',
                '我曾经拥有着的一切',
                '转眼都飘散如烟',
                '我曾经失落失望',
                '失掉所有方向',
                '直到看见平凡',
                '才是唯一的答案'
            ],
            letter: null // null 会用cnchar自动生成首字母
        }
    },
    {
        name: '可惜没如果-林俊杰',
        choosed: false,
        data: {
            delay: 250,
            area: ['=', '+', '-'], // null 表示全部
            key: [
                '5 3+ 2+ 3+',
                '3+ 2+ 3+ 1+ 7&7 5+ 5+&5+',
                '3+ 2+ 3+ 7 6&6 6+',
                '5+ 4+ 3+ 4+ 4+&3+',
                '3+ 2+ 3+ 7 6&6 6+',
                '5+ 4+ 3+ 4+ 5+&5+',
                '1+ 2+ 3+ 2+ 3+',
                '1+ 2+ 3+&2+ 2+ 3+',
                '1+ 2+ 3+ 2+ 4+',
                '5 3+ 2+ 3+',
                '5 3+ 2+ 3+ 1+ 7&7 5+ 5+&5+',
                '3+ 2+ 3+ 7 6&6+ 6+',
                '5+ 4+ 3+ 4+ 4+&3+',
                '5+ 4+ 3+ 7 6 6+',
                '5+ 4+ 3+ 4+ 5+&5+',
                '1+ 2+ 3+ 2+ 3+',
                '1+ 2+ 3+ 2+ 3+',
                '1+ 2+ 3+ 2+ 4+',
                '4+ 3+ 4+&4+ 7 1+'
            ],
            word: [
                '全都怪我',
                '不该沉默时沉默',
                '该勇敢时软弱',
                '如果不是我',
                '误会自己洒脱',
                '让我们难过',
                '可当初的你',
                '和现在的我',
                '假如重来过',
                '倘若那天',
                '把该说的话好好说',
                '该体谅的不执着',
                '如果那天我',
                '不受情绪挑拨',
                '你会怎么做',
                '那么多如果',
                '可能如果我',
                '可惜没如果',
                '只剩下结果'
            ],
            letter: null // null 会用cnchar自动生成首字母
        }
    }

    // 画
    // 易燃易爆炸
];